jmeter/test-report/statistics.json
{
  "Get User Profile" : {
    "transaction" : "Get User Profile",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 10.711225364181661,
    "receivedKBytesPerSec" : 12.489456137532134,
    "sentKBytesPerSec" : 0.0
  },
  "Login (Get Token)" : {
    "transaction" : "Login (Get Token)",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 10.673497705197992,
    "receivedKBytesPerSec" : 12.424618422457039,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 510,
    "errorCount" : 510,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 54.43483829650977,
    "receivedKBytesPerSec" : 63.51200184784929,
    "sentKBytesPerSec" : 0.0
  },
  "Get Formation by ID" : {
    "transaction" : "Get Formation by ID",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 23.089355806972986,
    "receivedKBytesPerSec" : 27.215676229508194,
    "sentKBytesPerSec" : 0.0
  },
  "Signup API" : {
    "transaction" : "Signup API",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 8.143322475570033,
    "receivedKBytesPerSec" : 9.48728878257329,
    "sentKBytesPerSec" : 0.0
  },
  "Get All Formations" : {
    "transaction" : "Get All Formations",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 22.9147571035747,
    "receivedKBytesPerSec" : 26.674209440879928,
    "sentKBytesPerSec" : 0.0
  },
  "Login API" : {
    "transaction" : "Login API",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 7.739938080495356,
    "receivedKBytesPerSec" : 9.009771671826625,
    "sentKBytesPerSec" : 0.0
  },
  "Get Courses" : {
    "transaction" : "Get Courses",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 10.711225364181661,
    "receivedKBytesPerSec" : 12.43715523243359,
    "sentKBytesPerSec" : 0.0
  }
}